/**
 * Created by zhangyuxin on 17/6/15.
 */
export default{
  pointUnique: {
    "s_1001002": {
      "cx": "40",
      "cy": "794",
      "id": "1001002",
      "name": "苹果园",
      "transfer": false,
      "namePoint": {"x": "-6", "y": "799"},
      "nextId": ["s_1001003"],
      "lineId": ["1001"]
    },
    "s_1001003": {
      "cx": "66",
      "cy": "836",
      "id": "1001003",
      "name": "古城",
      "transfer": false,
      "namePoint": {"x": "66", "y": "856"},
      "nextId": ["s_1001004"],
      "lineId": ["1001"]
    },
    "s_1001004": {
      "cx": "131",
      "cy": "836",
      "id": "1001004",
      "name": "八角游乐园",
      "transfer": false,
      "namePoint": {"x": "105", "y": "826"},
      "nextId": ["s_1001005"],
      "lineId": ["1001"]
    },
    "s_1001005": {
      "cx": "204",
      "cy": "836",
      "id": "1001005",
      "name": "八宝山",
      "transfer": false,
      "namePoint": {"x": "192", "y": "856"},
      "nextId": ["s_1001006"],
      "lineId": ["1001"]
    },
    "s_1001006": {
      "cx": "263",
      "cy": "836",
      "id": "1001006",
      "name": "玉泉路",
      "transfer": false,
      "namePoint": {"x": "251", "y": "856"},
      "nextId": ["s_1001007"],
      "lineId": ["1001"]
    },
    "s_1001007": {
      "cx": "322",
      "cy": "836",
      "id": "1001007",
      "name": "五棵松",
      "transfer": false,
      "namePoint": {"x": "310", "y": "856"},
      "nextId": ["s_1001008"],
      "lineId": ["1001"]
    },
    "s_1001008": {
      "cx": "377",
      "cy": "836",
      "id": "1001008",
      "name": "万寿路",
      "transfer": false,
      "namePoint": {"x": "365", "y": "856"},
      "nextId": ["s_1001009"],
      "lineId": ["1001"]
    },
    "s_1001009": {
      "cx": "432",
      "cy": "836",
      "id": "1001009",
      "name": "公主坟",
      "transfer": true,
      "namePoint": {"x": "448", "y": "826"},
      "nextId": ["s_1001010", "s_1010042"],
      "lineId": ["1001", "1010"]
    },
    "s_1001010": {
      "cx": "502",
      "cy": "836",
      "id": "1001010",
      "name": "军事博物馆",
      "transfer": true,
      "namePoint": {"x": "518", "y": "825"},
      "nextId": ["s_1001011", "s_1009012"],
      "lineId": ["1001", "1009"]
    },
    "s_1001011": {
      "cx": "570",
      "cy": "836",
      "id": "1001011",
      "name": "木樨地",
      "transfer": false,
      "namePoint": {"x": "556", "y": "856"},
      "nextId": ["s_1001012"],
      "lineId": ["1001"]
    },
    "s_1001012": {
      "cx": "628",
      "cy": "836",
      "id": "1001012",
      "name": "南礼士路",
      "transfer": false,
      "namePoint": {"x": "614", "y": "856"},
      "nextId": ["s_1001013"],
      "lineId": ["1001"]
    },
    "s_1001013": {
      "cx": "674",
      "cy": "836",
      "id": "1001013",
      "name": "复兴门",
      "transfer": true,
      "namePoint": {"x": "686", "y": "826"},
      "nextId": ["s_1001014", "s_1002017"],
      "lineId": ["1001", "1002"]
    },
    "s_1001014": {
      "cx": "755",
      "cy": "836",
      "id": "1001014",
      "name": "西单",
      "transfer": true,
      "namePoint": {"x": "721", "y": "856"},
      "nextId": ["s_1001015", "s_1004017"],
      "lineId": ["1001", "1004"]
    },
    "s_1001015": {
      "cx": "806",
      "cy": "836",
      "id": "1001015",
      "name": "天安门西",
      "transfer": false,
      "namePoint": {"x": "783", "y": "856"},
      "nextId": ["s_1001016"],
      "lineId": ["1001"]
    },
    "s_1001016": {
      "cx": "874",
      "cy": "836",
      "id": "1001016",
      "name": "天安门东",
      "transfer": false,
      "namePoint": {"x": "858", "y": "826"},
      "nextId": ["s_1001017"],
      "lineId": ["1001"]
    },
    "s_1001017": {
      "cx": "931",
      "cy": "836",
      "id": "1001017",
      "name": "王府井",
      "transfer": false,
      "namePoint": {"x": "920", "y": "856"},
      "nextId": ["s_1001018"],
      "lineId": ["1001"]
    },
    "s_1001018": {
      "cx": "973",
      "cy": "836",
      "id": "1001018",
      "name": "东单",
      "transfer": true,
      "namePoint": {"x": "990", "y": "856"},
      "nextId": ["s_1001019", "s_1005008"],
      "lineId": ["1001", "1005"]
    },
    "s_1001019": {
      "cx": "1046",
      "cy": "836",
      "id": "1001019",
      "name": "建国门",
      "transfer": true,
      "bezier": [null, {"x": "1046", "y": "880"}],
      "namePoint": {"x": "1064", "y": "856"},
      "nextId": ["s_1001020", "s_1002010"],
      "lineId": ["1001", "1002"]
    },
    "s_1001020": {
      "cx": "1126",
      "cy": "836",
      "id": "1001020",
      "name": "永安里",
      "transfer": false,
      "namePoint": {"x": "1114", "y": "856"},
      "nextId": ["s_1001021"],
      "lineId": ["1001"]
    },
    "s_1001021": {
      "cx": "1163",
      "cy": "836",
      "id": "1001021",
      "name": "国贸",
      "transfer": true,
      "namePoint": {"x": "1179", "y": "856"},
      "nextId": ["s_1001022", "s_1010022"],
      "lineId": ["1001", "1010"]
    },
    "s_1001022": {
      "cx": "1229",
      "cy": "836",
      "id": "1001022",
      "name": "大望路",
      "transfer": true,
      "namePoint": {"x": "1244", "y": "826"},
      "nextId": ["s_1001023", "s_1007014"],
      "lineId": ["1001", "1014"]
    },
    "s_1001023": {
      "cx": "1273",
      "cy": "841",
      "id": "1001023",
      "name": "四惠",
      "transfer": true,
      "namePoint": {"x": "1273", "y": "864"},
      "nextId": ["s_1001024", "s_1001024"],
      "lineId": ["1001", "1001"]
    },
    "s_1001024": {
      "cx": "1314",
      "cy": "841",
      "id": "1001024",
      "name": "四惠东",
      "transfer": true,
      "namePoint": {"x": "1314", "y": "864"},
      "nextId": ["s_1051004"],
      "lineId": ["1051", "1001"]
    },
    "s_1002002": {
      "cx": "729",
      "cy": "644",
      "id": "1002002",
      "name": "积水潭",
      "transfer": false,
      "namePoint": {"x": "721", "y": "634"},
      "nextId": ["s_1002003"],
      "lineId": ["1002"]
    },
    "s_1002003": {
      "cx": "856",
      "cy": "644",
      "id": "1002003",
      "name": "鼓楼大街",
      "transfer": true,
      "namePoint": {"x": "793", "y": "634"},
      "nextId": ["s_1002004", "s_1008005"],
      "lineId": ["1002", "1008"]
    },
    "s_1002004": {
      "cx": "928",
      "cy": "644",
      "id": "1002004",
      "name": "安定门",
      "transfer": false,
      "namePoint": {"x": "915", "y": "664"},
      "nextId": ["s_1002005"],
      "lineId": ["1002"]
    },
    "s_1002005": {
      "cx": "973",
      "cy": "644",
      "id": "1002005",
      "name": "雍和宫",
      "transfer": true,
      "bezier": [{"x": "1058", "y": "639"}, null],
      "namePoint": {"x": "993", "y": "634"},
      "nextId": ["s_1002006", "s_1005013"],
      "lineId": ["1002", "1005"]
    },
    "s_1002006": {
      "cx": "1046",
      "cy": "680",
      "id": "1002006",
      "name": "东直门",
      "transfer": true,
      "bezier": [null, {"x": "1113", "y": "680", "x2": "1113", "y2": "680"}],
      "namePoint": {"x": "1062", "y": "700"},
      "nextId": ["s_1002007", "s_1010015"],
      "lineId": ["1002", "1054", "1013"]
    },
    "s_1002007": {
      "cx": "1046",
      "cy": "730",
      "id": "1002007",
      "name": "东四十条",
      "transfer": false,
      "namePoint": {"x": "1065", "y": "735"},
      "nextId": ["s_1002008"],
      "lineId": ["1002"]
    },
    "s_1002008": {
      "cx": "1046",
      "cy": "766",
      "id": "1002008",
      "name": "朝阳门",
      "transfer": true,
      "namePoint": {"x": "1065", "y": "786"},
      "nextId": ["s_1001019", "s_1005009"],
      "lineId": ["1002", "1006"]
    },
    "s_1002010": {
      "cx": "1035",
      "cy": "880",
      "id": "1002010",
      "name": "北京站",
      "transfer": false,
      "bezier": [{"x": "1035", "y": "887"}],
      "namePoint": {"x": "1052", "y": "895"},
      "nextId": ["s_1002011"],
      "lineId": ["1002"]
    },
    "s_1002011": {
      "cx": "973",
      "cy": "887",
      "id": "1002011",
      "name": "崇文门",
      "transfer": true,
      "namePoint": {"x": "993", "y": "907"},
      "nextId": ["s_1002012", "s_1001018"],
      "lineId": ["1002", "1005"]
    },
    "s_1002012": {
      "cx": "891",
      "cy": "887",
      "id": "1002012",
      "name": "前门",
      "transfer": false,
      "namePoint": {"x": "891", "y": "907"},
      "nextId": ["s_1002013"],
      "lineId": ["1002"]
    },
    "s_1002013": {
      "cx": "837",
      "cy": "887",
      "id": "1002013",
      "name": "和平门",
      "transfer": false,
      "namePoint": {"x": "830", "y": "907"},
      "nextId": ["s_1002014"],
      "lineId": ["1002"]
    },
    "s_1002014": {
      "cx": "754",
      "cy": "887",
      "id": "1002014",
      "name": "宣武门",
      "transfer": true,
      "bezier": [{"x": "682", "y": "887"}, null],
      "namePoint": {"x": "708", "y": "907"},
      "nextId": ["s_1002015", "s_1001014"],
      "lineId": ["1002", "1004"]
    },
    "s_1002015": {
      "cx": "682",
      "cy": "875",
      "id": "1002015",
      "name": "长椿街",
      "transfer": false,
      "bezier": [{"x": "674", "y": "875"}],
      "namePoint": {"x": "636", "y": "895"},
      "nextId": ["s_1001013"],
      "lineId": ["1002"]
    },
    "s_1002017": {
      "cx": "674",
      "cy": "774",
      "id": "1002017",
      "name": "阜成门",
      "transfer": false,
      "namePoint": {"x": "628", "y": "779"},
      "nextId": ["s_1002018"],
      "lineId": ["1002"]
    },
    "s_1002018": {
      "cx": "674",
      "cy": "726",
      "id": "1002018",
      "name": "车公庄",
      "transfer": true,
      "namePoint": {"x": "692", "y": "746"},
      "nextId": ["s_1002019", "s_1006006"],
      "lineId": ["1002", "1006"]
    },
    "s_1002019": {
      "cx": "674",
      "cy": "679",
      "id": "1002019",
      "name": "西直门",
      "transfer": true,
      "bezier": [{"x": "674", "y": "644"}, null, {"x": "657", "y": "679"}],
      "namePoint": {"x": "691", "y": "702"},
      "nextId": ["s_1002002", "s_1004012", "s_1013016"],
      "isEnd": "true",
      "lineId": ["1002", "1004", "1013"]
    },
    "s_1004036": {
      "cx": "754",
      "cy": "1573",
      "id": "1004036",
      "name": "天宫院",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1578"},
      "nextId": ["s_1004035"],
      "lineId": ["1004"]
    },
    "s_1004035": {
      "cx": "754",
      "cy": "1515",
      "id": "1004035",
      "name": "生物医药基地",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1520"},
      "nextId": ["s_1004034"],
      "lineId": ["1004"]
    },
    "s_1004034": {
      "cx": "754",
      "cy": "1483",
      "id": "1004034",
      "name": "义和庄",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1488"},
      "nextId": ["s_1004033"],
      "lineId": ["1004"]
    },
    "s_1004033": {
      "cx": "754",
      "cy": "1451",
      "id": "1004033",
      "name": "黄村火车站",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1456"},
      "nextId": ["s_1004032"],
      "lineId": ["1004"]
    },
    "s_1004032": {
      "cx": "754",
      "cy": "1412",
      "id": "1004032",
      "name": "黄村西大街",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1417"},
      "nextId": ["s_1004031"],
      "lineId": ["1004"]
    },
    "s_1004031": {
      "cx": "754",
      "cy": "1377",
      "id": "1004031",
      "name": "清源路",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1382"},
      "nextId": ["s_1004030"],
      "lineId": ["1004"]
    },
    "s_1004030": {
      "cx": "754",
      "cy": "1338",
      "id": "1004030",
      "name": "枣园",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1343"},
      "nextId": ["s_1004029"],
      "lineId": ["1004"]
    },
    "s_1004029": {
      "cx": "754",
      "cy": "1301",
      "id": "1004029",
      "name": "高米店南",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1306"},
      "nextId": ["s_1004028"],
      "lineId": ["1004"]
    },
    "s_1004028": {
      "cx": "754",
      "cy": "1265",
      "id": "1004028",
      "name": "高米店北",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1270"},
      "nextId": ["s_1004027"],
      "lineId": ["1004"]
    },
    "s_1004027": {
      "cx": "754",
      "cy": "1221",
      "id": "1004027",
      "name": "西红门",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1226"},
      "nextId": ["s_1004026"],
      "lineId": ["1004"]
    },
    "s_1004026": {
      "cx": "754",
      "cy": "1182",
      "id": "1004026",
      "name": "新宫",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1187"},
      "nextId": ["s_1004025"],
      "lineId": ["1004"]
    },
    "s_1004025": {
      "cx": "754",
      "cy": "1139",
      "id": "1004025",
      "name": "公益西桥",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1144"},
      "nextId": ["s_1004024"],
      "lineId": ["1004"]
    },
    "s_1004024": {
      "cx": "754",
      "cy": "1086",
      "id": "1004024",
      "name": "角门西",
      "transfer": true,
      "namePoint": {"x": "772", "y": "1076"},
      "nextId": ["s_1004023", "s_1010033"],
      "lineId": ["1004", "1010"]
    },
    "s_1004023": {
      "cx": "754",
      "cy": "1045",
      "id": "1004023",
      "name": "马家堡",
      "transfer": false,
      "namePoint": {"x": "772", "y": "1050"},
      "nextId": ["s_1004022"],
      "lineId": ["1004"]
    },
    "s_1004022": {
      "cx": "754",
      "cy": "1003",
      "id": "1004022",
      "name": "北京南站",
      "transfer": true,
      "namePoint": {"x": "688", "y": "1008"},
      "nextId": ["s_1004021"],
      "lineId": ["1004", "1014"]
    },
    "s_1004021": {
      "cx": "754",
      "cy": "965",
      "id": "1004021",
      "name": "陶然亭",
      "transfer": false,
      "namePoint": {"x": "772", "y": "970"},
      "nextId": ["s_1004020"],
      "lineId": ["1004"]
    },
    "s_1004020": {
      "cx": "754",
      "cy": "929",
      "id": "1004020",
      "name": "菜市口",
      "transfer": true,
      "namePoint": {"x": "772", "y": "919"},
      "nextId": ["s_1002014", "s_1007006"],
      "lineId": ["1004", "1007"]
    },
    "s_1004017": {
      "cx": "754",
      "cy": "801",
      "id": "1004017",
      "name": "灵境胡同",
      "transfer": false,
      "namePoint": {"x": "772", "y": "806"},
      "nextId": ["s_1004016"],
      "lineId": ["1004"]
    },
    "s_1004016": {
      "cx": "755",
      "cy": "767",
      "id": "1004016",
      "name": "西四",
      "transfer": false,
      "namePoint": {"x": "772", "y": "772"},
      "nextId": ["s_1004015"],
      "lineId": ["1004"]
    },
    "s_1004015": {
      "cx": "754",
      "cy": "726",
      "id": "1004015",
      "name": "平安里",
      "transfer": true,
      "namePoint": {"x": "772", "y": "746"},
      "nextId": ["s_1004014", "s_1002018"],
      "lineId": ["1004", "1006"]
    },
    "s_1004014": {
      "cx": "752",
      "cy": "685",
      "id": "1004014",
      "name": "新街口",
      "transfer": false,
      "bezier": [{"x": "752", "y": "679"}],
      "namePoint": {"x": "770", "y": "690"},
      "nextId": ["s_1002019"],
      "lineId": ["1004"]
    },
    "s_1004012": {
      "cx": "620",
      "cy": "679",
      "id": "1004012",
      "name": "动物园",
      "transfer": false,
      "namePoint": {"x": "610", "y": "669"},
      "nextId": ["s_1004011"],
      "lineId": ["1004"]
    },
    "s_1004011": {
      "cx": "502",
      "cy": "676",
      "id": "1004011",
      "name": "国家图书馆",
      "transfer": true,
      "bezier": [{"x": "489", "y": "676"}, null],
      "namePoint": {"x": "418", "y": "681"},
      "nextId": ["s_1004010"],
      "lineId": ["1004", "1009"]
    },
    "s_1004010": {
      "cx": "489",
      "cy": "631",
      "id": "1004010",
      "name": "魏公村",
      "transfer": false,
      "namePoint": {"x": "442", "y": "636"},
      "nextId": ["s_1004009"],
      "lineId": ["1004"]
    },
    "s_1004009": {
      "cx": "489",
      "cy": "578",
      "id": "1004009",
      "name": "人民大学",
      "transfer": false,
      "namePoint": {"x": "426", "y": "583"},
      "nextId": ["s_1004008"],
      "lineId": ["1004"]
    },
    "s_1004008": {
      "cx": "489",
      "cy": "521",
      "id": "1004008",
      "name": "海淀黄庄",
      "transfer": true,
      "namePoint": {"x": "507", "y": "511"},
      "nextId": ["s_1004007", "s_1010005"],
      "lineId": ["1004", "1010"]
    },
    "s_1004007": {
      "cx": "488",
      "cy": "482",
      "id": "1004007",
      "name": "中关村",
      "transfer": false,
      "namePoint": {"x": "442", "y": "487"},
      "nextId": ["s_1004006"],
      "lineId": ["1004"]
    },
    "s_1004006": {
      "cx": "489",
      "cy": "440",
      "id": "1004006",
      "name": "北京大学东门",
      "transfer": false,
      "namePoint": {"x": "394", "y": "445"},
      "nextId": ["s_1004005"],
      "lineId": ["1004"]
    },
    "s_1004005": {
      "cx": "489",
      "cy": "397",
      "id": "1004005",
      "name": "圆明园",
      "transfer": false,
      "bezier": [{"x": "489", "y": "385"}],
      "namePoint": {"x": "508", "y": "402"},
      "nextId": ["s_1004004"],
      "lineId": ["1004"]
    },
    "s_1004004": {
      "cx": "416",
      "cy": "385",
      "id": "1004004",
      "name": "西苑",
      "transfer": true,
      "namePoint": {"x": "416", "y": "410"},
      "nextId": ["s_1004003"],
      "lineId": ["1004", "1016"]
    },
    "s_1004003": {
      "cx": "343",
      "cy": "385",
      "id": "1004003",
      "name": "北宫门",
      "transfer": false,
      "namePoint": {"x": "333", "y": "409"},
      "nextId": ["s_1004002"],
      "lineId": ["1004"]
    },
    "s_1004002": {
      "cx": "266",
      "cy": "385",
      "id": "1004002",
      "name": "安河桥北",
      "transfer": false,
      "namePoint": {"x": "250", "y": "409"},
      "lineId": ["1004"]
    },
    "s_1005001": {
      "cx": "973",
      "cy": "1086",
      "id": "1005001",
      "name": "宋家庄",
      "transfer": true,
      "namePoint": {"x": "993", "y": "1106"},
      "nextId": ["s_1005002", "s_1010029", "s_1055002"],
      "lineId": ["1005", "1010", "1055"]
    },
    "s_1005002": {
      "cx": "973",
      "cy": "1039",
      "id": "1005002",
      "name": "刘家窑",
      "transfer": false,
      "namePoint": {"x": "993", "y": "1044"},
      "nextId": ["s_1005003"],
      "lineId": ["1005"]
    },
    "s_1005003": {
      "cx": "973",
      "cy": "1003",
      "id": "1005003",
      "name": "蒲黄榆",
      "transfer": true,
      "namePoint": {"x": "993", "y": "993"},
      "nextId": ["s_1005004", "s_1014018"],
      "lineId": ["1005", "1014"]
    },
    "s_1005004": {
      "cx": "973",
      "cy": "965",
      "id": "1005004",
      "name": "天坛东门",
      "transfer": false,
      "namePoint": {"x": "993", "y": "970"},
      "nextId": ["s_1005005"],
      "lineId": ["1005"]
    },
    "s_1005005": {
      "cx": "973",
      "cy": "929",
      "id": "1005005",
      "name": "磁器口",
      "transfer": true,
      "namePoint": {"x": "927", "y": "919"},
      "nextId": ["s_1002011", "s_1007010"],
      "lineId": ["1005", "1007"]
    },
    "s_1005008": {
      "cx": "973",
      "cy": "800",
      "id": "1005008",
      "name": "灯市口",
      "transfer": false,
      "namePoint": {"x": "993", "y": "805"},
      "nextId": ["s_1005009"],
      "lineId": ["1005"]
    },
    "s_1005009": {
      "cx": "973",
      "cy": "766",
      "id": "1005009",
      "name": "东四",
      "transfer": true,
      "namePoint": {"x": "993", "y": "756"},
      "nextId": ["s_1005010", "s_1006010"],
      "lineId": ["1005", "1006"]
    },
    "s_1005010": {
      "cx": "973",
      "cy": "715",
      "id": "1005010",
      "name": "张自忠路",
      "transfer": false,
      "namePoint": {"x": "990", "y": "720"},
      "nextId": ["s_1005011"],
      "lineId": ["1005"]
    },
    "s_1005011": {
      "cx": "973",
      "cy": "679",
      "id": "1005011",
      "name": "北新桥",
      "transfer": false,
      "namePoint": {"x": "993", "y": "684"},
      "nextId": ["s_1002005"],
      "lineId": ["1005"]
    },
    "s_1005013": {
      "cx": "973",
      "cy": "599",
      "id": "1005013",
      "name": "和平里北街",
      "transfer": false,
      "namePoint": {"x": "993", "y": "604"},
      "nextId": ["s_1005014"],
      "lineId": ["1005"]
    },
    "s_1005014": {
      "cx": "973",
      "cy": "565",
      "id": "1005014",
      "name": "和平西桥",
      "transfer": false,
      "namePoint": {"x": "993", "y": "570"},
      "nextId": ["s_1005015"],
      "lineId": ["1005"]
    },
    "s_1005015": {
      "cx": "973",
      "cy": "521",
      "id": "1005015",
      "name": "惠新西街南口",
      "transfer": true,
      "namePoint": {"x": "990", "y": "543"},
      "nextId": ["s_1005016", "s_1010013"],
      "lineId": ["1005", "1010"]
    },
    "s_1005016": {
      "cx": "973",
      "cy": "485",
      "id": "1005016",
      "name": "惠新西街北口",
      "transfer": false,
      "namePoint": {"x": "990", "y": "490"},
      "nextId": ["s_1005017"],
      "lineId": ["1005"]
    },
    "s_1005017": {
      "cx": "973",
      "cy": "448",
      "id": "1005017",
      "name": "大屯路东",
      "transfer": true,
      "namePoint": {"x": "993", "y": "438"},
      "nextId": ["s_1005018", "s_1015016"],
      "lineId": ["1005", "1015"]
    },
    "s_1005018": {
      "cx": "973",
      "cy": "395",
      "id": "1005018",
      "name": "北苑路北",
      "transfer": false,
      "namePoint": {"x": "993", "y": "400"},
      "nextId": ["s_1005019"],
      "lineId": ["1005"]
    },
    "s_1005019": {
      "cx": "973",
      "cy": "353",
      "id": "1005019",
      "name": "立水桥南",
      "transfer": false,
      "namePoint": {"x": "993", "y": "358"},
      "nextId": ["s_1005020"],
      "lineId": ["1005"]
    },
    "s_1005020": {
      "cx": "973",
      "cy": "310",
      "id": "1005020",
      "name": "立水桥",
      "transfer": true,
      "bezier": [null, {"x": "1072", "y": "310", "x2": "1075", "y2": "310"}],
      "namePoint": {"x": "993", "y": "300"},
      "nextId": ["s_1005021", "s_1013007"],
      "lineId": ["1005", "1013"]
    },
    "s_1005021": {
      "cx": "973",
      "cy": "259",
      "id": "1005021",
      "name": "天通苑南",
      "transfer": false,
      "namePoint": {"x": "993", "y": "264"},
      "nextId": ["s_1005022"],
      "lineId": ["1005"]
    },
    "s_1005022": {
      "cx": "973",
      "cy": "221",
      "id": "1005022",
      "name": "天通苑",
      "transfer": false,
      "namePoint": {"x": "993", "y": "226"},
      "nextId": ["s_1005023"],
      "lineId": ["1005"]
    },
    "s_1005023": {
      "cx": "973",
      "cy": "186",
      "id": "1005023",
      "name": "天通苑北",
      "transfer": false,
      "namePoint": {"x": "993", "y": "191"},
      "lineId": ["1005"]
    },
    "s_1006027": {
      "cx": "2000",
      "cy": "897",
      "id": "1006027",
      "name": "潞城",
      "transfer": false,
      "namePoint": {"x": "2000", "y": "887"},
      "nextId": ["s_1006026"],
      "lineId": ["1006"]
    },
    "s_1006026": {
      "cx": "1947",
      "cy": "897",
      "id": "1006026",
      "name": "东夏园",
      "transfer": false,
      "namePoint": {"x": "1935", "y": "887"},
      "nextId": ["s_1006025"],
      "lineId": ["1006"]
    },
    "s_1006025": {
      "cx": "1897",
      "cy": "897",
      "id": "1006025",
      "name": "郝家府",
      "transfer": false,
      "namePoint": {"x": "1882", "y": "887"},
      "nextId": ["s_1006024"],
      "lineId": ["1006"]
    },
    "s_1006024": {
      "cx": "1797",
      "cy": "897",
      "id": "1006024",
      "name": "北运河西",
      "transfer": false,
      "namePoint": {"x": "1797", "y": "917"},
      "nextId": ["s_1006023"],
      "lineId": ["1006"]
    },
    "s_1006023": {
      "cx": "1706",
      "cy": "766",
      "id": "1006023",
      "name": "通州北关",
      "transfer": false,
      "namePoint": {"x": "1706", "y": "756"},
      "nextId": ["s_1006022"],
      "lineId": ["1006"]
    },
    "s_1006022": {
      "cx": "1636",
      "cy": "766",
      "id": "1006022",
      "name": "物资学院路",
      "transfer": false,
      "namePoint": {"x": "1606", "y": "786"},
      "nextId": ["s_1006021"],
      "lineId": ["1006"]
    },
    "s_1006021": {
      "cx": "1570",
      "cy": "766",
      "id": "1006021",
      "name": "草房",
      "transfer": false,
      "namePoint": {"x": "1565", "y": "756"},
      "nextId": ["s_1006020"],
      "lineId": ["1006"]
    },
    "s_1006020": {
      "cx": "1513",
      "cy": "766",
      "id": "1006020",
      "name": "常营",
      "transfer": false,
      "namePoint": {"x": "1508", "y": "786"},
      "nextId": ["s_1006019"],
      "lineId": ["1006"]
    },
    "s_1006019": {
      "cx": "1453",
      "cy": "766",
      "id": "1006019",
      "name": "黄渠",
      "transfer": false,
      "namePoint": {"x": "1449", "y": "756"},
      "nextId": ["s_1006018"],
      "lineId": ["1006"]
    },
    "s_1006018": {
      "cx": "1394",
      "cy": "766",
      "id": "1006018",
      "name": "褡裢坡",
      "transfer": false,
      "namePoint": {"x": "1382", "y": "786"},
      "nextId": ["s_1006017"],
      "lineId": ["1006"]
    },
    "s_1006017": {
      "cx": "1337",
      "cy": "766",
      "id": "1006017",
      "name": "青年路",
      "transfer": false,
      "namePoint": {"x": "1325", "y": "756"},
      "nextId": ["s_1006016"],
      "lineId": ["1006"]
    },
    "s_1006016": {
      "cx": "1279",
      "cy": "766",
      "id": "1006016",
      "name": "十里堡",
      "transfer": false,
      "namePoint": {"x": "1266", "y": "786"},
      "nextId": ["s_1006015"],
      "lineId": ["1006"]
    },
    "s_1006015": {
      "cx": "1229",
      "cy": "766",
      "id": "1006015",
      "name": "金台路",
      "transfer": true,
      "namePoint": {"x": "1245", "y": "756"},
      "nextId": ["s_1006014", "s_1001022"],
      "lineId": ["1006", "1014"]
    },
    "s_1006014": {
      "cx": "1163",
      "cy": "766",
      "id": "1006014",
      "name": "呼家楼",
      "transfer": true,
      "namePoint": {"x": "1180", "y": "756"},
      "nextId": ["s_1006013", "s_1010020"],
      "lineId": ["1006", "1010"]
    },
    "s_1006013": {
      "cx": "1105",
      "cy": "766",
      "id": "1006013",
      "name": "东大桥",
      "transfer": false,
      "namePoint": {"x": "1095", "y": "756"},
      "nextId": ["s_1002008"],
      "lineId": ["1006"]
    },
    "s_1006010": {
      "cx": "856",
      "cy": "726",
      "id": "1006010",
      "name": "南锣鼓巷",
      "transfer": true,
      "namePoint": {"x": "876", "y": "721"},
      "nextId": ["s_1006009", "s_1008003"],
      "lineId": ["1006", "1008"]
    },
    "s_1006009": {
      "cx": "804",
      "cy": "726",
      "id": "1006009",
      "name": "北海北",
      "transfer": false,
      "namePoint": {"x": "800", "y": "716"},
      "nextId": ["s_1004015"],
      "lineId": ["1006"]
    },
    "s_1006006": {
      "cx": "586",
      "cy": "726",
      "id": "1006006",
      "name": "车公庄西",
      "transfer": false,
      "namePoint": {"x": "586", "y": "746"},
      "nextId": ["s_1006005"],
      "lineId": ["1006"]
    },
    "s_1006005": {
      "cx": "502",
      "cy": "726",
      "id": "1006005",
      "name": "白石桥南",
      "transfer": true,
      "namePoint": {"x": "519", "y": "716"},
      "nextId": ["s_1006004", "s_1004011"],
      "lineId": ["1006", "1009"]
    },
    "s_1006004": {
      "cx": "414",
      "cy": "726",
      "id": "1006004",
      "name": "花园桥",
      "transfer": false,
      "namePoint": {"x": "409", "y": "716"},
      "nextId": ["s_1006003"],
      "lineId": ["1006"]
    },
    "s_1006003": {
      "cx": "329",
      "cy": "726",
      "id": "1006003",
      "name": "慈寿寺",
      "transfer": true,
      "namePoint": {"x": "349", "y": "716"},
      "nextId": ["s_1006002", "s_1010044"],
      "lineId": ["1006", "1010"]
    },
    "s_1006002": {
      "cx": "242",
      "cy": "726",
      "id": "1006002",
      "name": "海淀五路居",
      "transfer": false,
      "namePoint": {"x": "222", "y": "716"},
      "lineId": ["1006"]
    },
    "s_1007021": {
      "cx": "1414",
      "cy": "1033",
      "id": "1007021",
      "name": "焦化厂",
      "transfer": false,
      "namePoint": {"x": "1434", "y": "1038"},
      "nextId": ["s_1007020"],
      "lineId": ["1007"]
    },
    "s_1007020": {
      "cx": "1379",
      "cy": "1033",
      "id": "1007020",
      "name": "双合",
      "transfer": false,
      "bezier": [{"x": "1314", "y": "1033"}],
      "namePoint": {"x": "1372", "y": "1023"},
      "nextId": ["s_1007019"],
      "lineId": ["1007"]
    },
    "s_1007019": {
      "cx": "1314",
      "cy": "1028",
      "id": "1007019",
      "name": "欢乐谷景区",
      "transfer": false,
      "namePoint": {"x": "1290", "y": "1058"},
      "nextId": ["s_1007018"],
      "lineId": ["1007"]
    },
    "s_1007018": {
      "cx": "1313",
      "cy": "996",
      "id": "1007018",
      "name": "南楼梓庄",
      "transfer": false,
      "namePoint": {"x": "1333", "y": "1001"},
      "nextId": ["s_1007017"],
      "lineId": ["1007"]
    },
    "s_1007017": {
      "cx": "1312",
      "cy": "954",
      "id": "1007017",
      "name": "化工",
      "transfer": false,
      "bezier": [{"x": "1312", "y": "929"}],
      "namePoint": {"x": "1332", "y": "959"},
      "nextId": ["s_1007016"],
      "lineId": ["1007"]
    },
    "s_1007016": {
      "cx": "1306",
      "cy": "929",
      "id": "1007016",
      "name": "百子湾",
      "transfer": false,
      "namePoint": {"x": "1316", "y": "919"},
      "nextId": ["s_1007015"],
      "lineId": ["1007"]
    },
    "s_1007015": {
      "cx": "1268",
      "cy": "929",
      "id": "1007015",
      "name": "大郊亭",
      "transfer": false,
      "namePoint": {"x": "1258", "y": "951"},
      "nextId": ["s_1007014"],
      "lineId": ["1007"]
    },
    "s_1007014": {
      "cx": "1229",
      "cy": "929",
      "id": "1007014",
      "name": "九龙山",
      "transfer": true,
      "namePoint": {"x": "1247", "y": "919"},
      "nextId": ["s_1007013", "s_1014014"],
      "lineId": ["1007", "1014"]
    },
    "s_1007013": {
      "cx": "1121",
      "cy": "929",
      "id": "1007013",
      "name": "广渠门外",
      "transfer": false,
      "namePoint": {"x": "1101", "y": "951"},
      "nextId": ["s_1007012"],
      "lineId": ["1007"]
    },
    "s_1007012": {
      "cx": "1054",
      "cy": "929",
      "id": "1007012",
      "name": "广渠门内",
      "transfer": false,
      "namePoint": {"x": "1030", "y": "951"},
      "nextId": ["s_1005005"],
      "lineId": ["1007"]
    },
    "s_1007010": {
      "cx": "930",
      "cy": "929",
      "id": "1007010",
      "name": "桥湾",
      "transfer": false,
      "namePoint": {"x": "924", "y": "951"},
      "nextId": ["s_1007009"],
      "lineId": ["1007"]
    },
    "s_1007009": {
      "cx": "870",
      "cy": "929",
      "id": "1007009",
      "name": "珠市口",
      "transfer": false,
      "namePoint": {"x": "860", "y": "951"},
      "nextId": ["s_1007008"],
      "lineId": ["1007"]
    },
    "s_1007008": {
      "cx": "810",
      "cy": "929",
      "id": "1007008",
      "name": "虎坊桥",
      "transfer": false,
      "namePoint": {"x": "795", "y": "951"},
      "nextId": ["s_1004020"],
      "lineId": ["1007"]
    },
    "s_1007006": {
      "cx": "698",
      "cy": "929",
      "id": "1007006",
      "name": "广安门内",
      "transfer": false,
      "namePoint": {"x": "678", "y": "951"},
      "nextId": ["s_1007005"],
      "lineId": ["1007"]
    },
    "s_1007005": {
      "cx": "639",
      "cy": "929",
      "id": "1007005",
      "name": "达官营",
      "transfer": false,
      "namePoint": {"x": "625", "y": "951"},
      "nextId": ["s_1007004"],
      "lineId": ["1007"]
    },
    "s_1007004": {
      "cx": "564",
      "cy": "929",
      "id": "1007004",
      "name": "湾子",
      "transfer": false,
      "namePoint": {"x": "564", "y": "951"},
      "nextId": ["s_1007003"],
      "lineId": ["1007"]
    },
    "s_1007003": {
      "cx": "502",
      "cy": "878",
      "id": "1007003",
      "name": "北京西站",
      "transfer": true,
      "namePoint": {"x": "527", "y": "883"},
      "nextId": ["s_1001010"],
      "lineId": ["1009", "1007"]
    },
    "s_1008003": {
      "cx": "856",
      "cy": "691",
      "id": "1008003",
      "name": "什刹海",
      "transfer": false,
      "namePoint": {"x": "876", "y": "696"},
      "nextId": ["s_1002003"],
      "lineId": ["1008"]
    },
    "s_1008005": {
      "cx": "856",
      "cy": "611",
      "id": "1008005",
      "name": "安德里北街",
      "transfer": false,
      "namePoint": {"x": "876", "y": "616"},
      "nextId": ["s_1008006"],
      "lineId": ["1008"]
    },
    "s_1008006": {
      "cx": "856",
      "cy": "583",
      "id": "1008006",
      "name": "安华桥",
      "transfer": false,
      "namePoint": {"x": "876", "y": "588"},
      "nextId": ["s_1008007"],
      "lineId": ["1008"]
    },
    "s_1008007": {
      "cx": "856",
      "cy": "521",
      "id": "1008007",
      "name": "北土城",
      "transfer": true,
      "namePoint": {"x": "876", "y": "543"},
      "nextId": ["s_1008008", "s_1010011"],
      "lineId": ["1008", "1010"]
    },
    "s_1008008": {
      "cx": "856",
      "cy": "494",
      "id": "1008008",
      "name": "奥体中心",
      "transfer": false,
      "namePoint": {"x": "794", "y": "499"},
      "nextId": ["s_1008009"],
      "lineId": ["1008"]
    },
    "s_1008009": {
      "cx": "856",
      "cy": "469",
      "id": "1008009",
      "name": "奥林匹克公园",
      "transfer": true,
      "namePoint": {"x": "876", "y": "489"},
      "nextId": ["s_1008010", "s_1015018"],
      "lineId": ["1008", "1015"]
    },
    "s_1008010": {
      "cx": "856",
      "cy": "435",
      "id": "1008010",
      "name": "森林公园南门",
      "transfer": false,
      "namePoint": {"x": "761", "y": "440"},
      "nextId": ["s_1008011"],
      "lineId": ["1008"]
    },
    "s_1008011": {
      "cx": "856",
      "cy": "416",
      "id": "1008011",
      "name": "林萃桥",
      "transfer": false,
      "namePoint": {"x": "810", "y": "421"},
      "nextId": ["s_1008012"],
      "lineId": ["1008"]
    },
    "s_1008012": {
      "cx": "856",
      "cy": "390",
      "id": "1008012",
      "name": "永泰庄",
      "transfer": false,
      "namePoint": {"x": "810", "y": "395"},
      "nextId": ["s_1008013"],
      "lineId": ["1008"]
    },
    "s_1008013": {
      "cx": "856",
      "cy": "364",
      "id": "1008013",
      "name": "西小口",
      "transfer": false,
      "namePoint": {"x": "810", "y": "369"},
      "nextId": ["s_1008014"],
      "lineId": ["1008"]
    },
    "s_1008014": {
      "cx": "856",
      "cy": "338",
      "id": "1008014",
      "name": "育新",
      "transfer": false,
      "namePoint": {"x": "822", "y": "343"},
      "nextId": ["s_1008015"],
      "lineId": ["1008"]
    },
    "s_1008015": {
      "cx": "856",
      "cy": "310",
      "id": "1008015",
      "name": "霍营",
      "transfer": true,
      "namePoint": {"x": "876", "y": "300"},
      "nextId": ["s_1008016", "s_1005020"],
      "lineId": ["1008", "1013"]
    },
    "s_1008016": {
      "cx": "856",
      "cy": "261",
      "id": "1008016",
      "name": "回龙观东大街",
      "transfer": false,
      "bezier": [{"x": "856", "y": "235"}],
      "namePoint": {"x": "876", "y": "266"},
      "nextId": ["s_1008017"],
      "lineId": ["1008"]
    },
    "s_1008017": {
      "cx": "820",
      "cy": "235",
      "id": "1008017",
      "name": "平西府",
      "transfer": false,
      "namePoint": {"x": "807", "y": "225"},
      "nextId": ["s_1008018"],
      "lineId": ["1008"]
    },
    "s_1008018": {
      "cx": "756",
      "cy": "235",
      "id": "1008018",
      "name": "育知路",
      "transfer": false,
      "namePoint": {"x": "742", "y": "225"},
      "nextId": ["s_1008019"],
      "lineId": ["1008"]
    },
    "s_1008019": {
      "cx": "657",
      "cy": "235",
      "id": "1008019",
      "name": "朱辛庄",
      "transfer": true,
      "namePoint": {"x": "607", "y": "240"},
      "nextId": ["s_1052002"],
      "lineId": ["1052", "1008"]
    },
    "s_1009002": {
      "cx": "397",
      "cy": "1134",
      "id": "1009002",
      "name": "郭公庄",
      "transfer": true,
      "namePoint": {"x": "349", "y": "1139"},
      "nextId": ["s_1009003"],
      "lineId": ["1009", "1053"]
    },
    "s_1009003": {
      "cx": "397",
      "cy": "1103",
      "id": "1009003",
      "name": "丰台科技园",
      "transfer": false,
      "namePoint": {"x": "317", "y": "1108"},
      "nextId": ["s_1009004"],
      "lineId": ["1009"]
    },
    "s_1009004": {
      "cx": "397",
      "cy": "1072",
      "id": "1009004",
      "name": "科怡路",
      "transfer": false,
      "namePoint": {"x": "349", "y": "1077"},
      "nextId": ["s_1009005"],
      "lineId": ["1009"]
    },
    "s_1009005": {
      "cx": "397",
      "cy": "1044",
      "id": "1009005",
      "name": "丰台南路",
      "transfer": false,
      "namePoint": {"x": "333", "y": "1049"},
      "nextId": ["s_1009006"],
      "lineId": ["1009"]
    },
    "s_1009006": {
      "cx": "397",
      "cy": "1017",
      "id": "1009006",
      "name": "丰台东大街",
      "transfer": false,
      "namePoint": {"x": "320", "y": "1022"},
      "nextId": ["s_1009007"],
      "lineId": ["1009"]
    },
    "s_1009007": {
      "cx": "396",
      "cy": "990",
      "id": "1009007",
      "name": "七里庄",
      "transfer": true,
      "namePoint": {"x": "350", "y": "980"},
      "nextId": ["s_1009008", "s_1014032"],
      "lineId": ["1009", "1014"]
    },
    "s_1009008": {
      "cx": "432",
      "cy": "933",
      "id": "1009008",
      "name": "六里桥",
      "transfer": true,
      "namePoint": {"x": "382", "y": "938"},
      "nextId": ["s_1009009", "s_1010040"],
      "lineId": ["1009", "1010"]
    },
    "s_1009009": {
      "cx": "461",
      "cy": "910",
      "id": "1009009",
      "name": "六里桥东",
      "transfer": false,
      "namePoint": {"x": "478", "y": "925"},
      "nextId": ["s_1007003"],
      "lineId": ["1009"]
    },
    "s_1009012": {
      "cx": "502",
      "cy": "778",
      "id": "1009012",
      "name": "白堆子",
      "transfer": false,
      "namePoint": {"x": "522", "y": "783"},
      "nextId": ["s_1006005"],
      "lineId": ["1009"]
    },
    "s_1010002": {
      "cx": "376",
      "cy": "521",
      "id": "1010002",
      "name": "巴沟",
      "transfer": false,
      "namePoint": {"x": "370", "y": "543"},
      "nextId": ["s_1010003"],
      "lineId": ["1010"]
    },
    "s_1010003": {
      "cx": "427",
      "cy": "521",
      "id": "1010003",
      "name": "苏州街",
      "transfer": false,
      "namePoint": {"x": "417", "y": "543"},
      "nextId": ["s_1004008"],
      "lineId": ["1010"]
    },
    "s_1010005": {
      "cx": "600",
      "cy": "521",
      "id": "1010005",
      "name": "知春里",
      "transfer": false,
      "namePoint": {"x": "590", "y": "543"},
      "nextId": ["s_1010006"],
      "lineId": ["1010"]
    },
    "s_1010006": {
      "cx": "657",
      "cy": "521",
      "id": "1010006",
      "name": "知春路",
      "transfer": true,
      "namePoint": {"x": "611", "y": "511"},
      "nextId": ["s_1010007", "s_1013014"],
      "lineId": ["1010", "1013"]
    },
    "s_1010007": {
      "cx": "698",
      "cy": "521",
      "id": "1010007",
      "name": "西土城",
      "transfer": false,
      "namePoint": {"x": "688", "y": "543"},
      "nextId": ["s_1010008"],
      "lineId": ["1010"]
    },
    "s_1010008": {
      "cx": "748",
      "cy": "521",
      "id": "1010008",
      "name": "牡丹园",
      "transfer": false,
      "namePoint": {"x": "738", "y": "543"},
      "nextId": ["s_1010009"],
      "lineId": ["1010"]
    },
    "s_1010009": {
      "cx": "803",
      "cy": "521",
      "id": "1010009",
      "name": "健德门",
      "transfer": false,
      "namePoint": {"x": "793", "y": "543"},
      "nextId": ["s_1008007"],
      "lineId": ["1010"]
    },
    "s_1010011": {
      "cx": "938",
      "cy": "521",
      "id": "1010011",
      "name": "安贞门",
      "transfer": false,
      "namePoint": {"x": "930", "y": "543"},
      "nextId": ["s_1005015"],
      "lineId": ["1010"]
    },
    "s_1010013": {
      "cx": "1072",
      "cy": "521",
      "id": "1010013",
      "name": "芍药居",
      "transfer": true,
      "namePoint": {"x": "1092", "y": "543"},
      "nextId": ["s_1010014", "s_1013004"],
      "lineId": ["1010", "1013"]
    },
    "s_1010014": {
      "cx": "1143",
      "cy": "521",
      "id": "1010014",
      "name": "太阳宫",
      "transfer": false,
      "bezier": [{"x": "1163", "y": "521"}],
      "namePoint": {"x": "1107", "y": "511"},
      "nextId": ["s_1010015"],
      "lineId": ["1010"]
    },
    "s_1010015": {
      "cx": "1163",
      "cy": "575",
      "id": "1010015",
      "name": "三元桥",
      "transfer": true,
      "namePoint": {"x": "1180", "y": "595"},
      "bezier": [null, {"x": "1512", "y": "460"}],
      "nextId": ["s_1010016", "s_1054003"],
      "lineId": ["1010", "1054"]
    },
    "s_1010016": {
      "cx": "1163",
      "cy": "620",
      "id": "1010016",
      "name": "亮马桥",
      "transfer": false,
      "namePoint": {"x": "1180", "y": "625"},
      "nextId": ["s_1010017"],
      "lineId": ["1010"]
    },
    "s_1010017": {
      "cx": "1163",
      "cy": "662",
      "id": "1010017",
      "name": "农业展览馆",
      "transfer": false,
      "namePoint": {"x": "1180", "y": "667"},
      "nextId": ["s_1010018"],
      "lineId": ["1010"]
    },
    "s_1010018": {
      "cx": "1163",
      "cy": "705",
      "id": "1010018",
      "name": "团结湖",
      "transfer": false,
      "namePoint": {"x": "1180", "y": "710"},
      "nextId": ["s_1006014"],
      "lineId": ["1010"]
    },
    "s_1010020": {
      "cx": "1163",
      "cy": "801",
      "id": "1010020",
      "name": "金台夕照",
      "transfer": false,
      "namePoint": {"x": "1101", "y": "806"},
      "nextId": ["s_1001021"],
      "lineId": ["1010"]
    },
    "s_1010022": {
      "cx": "1163",
      "cy": "919",
      "id": "1010022",
      "name": "双井",
      "transfer": false,
      "namePoint": {"x": "1180", "y": "919"},
      "nextId": ["s_1010023"],
      "lineId": ["1010"]
    },
    "s_1010023": {
      "cx": "1163",
      "cy": "949",
      "id": "1010023",
      "name": "劲松",
      "transfer": false,
      "namePoint": {"x": "1180", "y": "954"},
      "nextId": ["s_1010024"],
      "lineId": ["1010"]
    },
    "s_1010024": {
      "cx": "1163",
      "cy": "976",
      "id": "1010024",
      "name": "潘家园",
      "transfer": false,
      "namePoint": {"x": "1180", "y": "981"},
      "nextId": ["s_1010025"],
      "lineId": ["1010"]
    },
    "s_1010025": {
      "cx": "1163",
      "cy": "1003",
      "id": "1010025",
      "name": "十里河",
      "transfer": true,
      "bezier": [{"x": "1163", "y": "1086"}, null],
      "namePoint": {"x": "1180", "y": "1023"},
      "nextId": ["s_1010026", "s_1014016"],
      "lineId": ["1010", "1014"]
    },
    "s_1010026": {
      "cx": "1102",
      "cy": "1086",
      "id": "1010026",
      "name": "分钟寺",
      "transfer": false,
      "namePoint": {"x": "1092", "y": "1076"},
      "nextId": ["s_1010027"],
      "lineId": ["1010"]
    },
    "s_1010027": {
      "cx": "1046",
      "cy": "1086",
      "id": "1010027",
      "name": "成寿寺",
      "transfer": false,
      "namePoint": {"x": "1036", "y": "1076"},
      "nextId": ["s_1005001"],
      "lineId": ["1010"]
    },
    "s_1010029": {
      "cx": "919",
      "cy": "1086",
      "id": "1010029",
      "name": "石榴庄",
      "transfer": false,
      "namePoint": {"x": "909", "y": "1106"},
      "nextId": ["s_1010030"],
      "lineId": ["1010"]
    },
    "s_1010030": {
      "cx": "863",
      "cy": "1086",
      "id": "1010030",
      "name": "大红门",
      "transfer": false,
      "namePoint": {"x": "853", "y": "1076"},
      "nextId": ["s_1010031"],
      "lineId": ["1010"]
    },
    "s_1010031": {
      "cx": "809",
      "cy": "1086",
      "id": "1010031",
      "name": "角门东",
      "transfer": false,
      "namePoint": {"x": "799", "y": "1106"},
      "nextId": ["s_1004024"],
      "lineId": ["1010"]
    },
    "s_1010033": {
      "cx": "686",
      "cy": "1086",
      "id": "1010033",
      "name": "草桥",
      "transfer": false,
      "namePoint": {"x": "680", "y": "1076"},
      "nextId": ["s_1010034"],
      "lineId": ["1010"]
    },
    "s_1010034": {
      "cx": "620",
      "cy": "1086",
      "id": "1010034",
      "name": "纪家庙",
      "transfer": false,
      "namePoint": {"x": "610", "y": "1076"},
      "nextId": ["s_1010035"],
      "lineId": ["1010"]
    },
    "s_1010035": {
      "cx": "552",
      "cy": "1086",
      "id": "1010035",
      "name": "首经贸",
      "transfer": false,
      "namePoint": {"x": "542", "y": "1076"},
      "nextId": ["s_1010036"],
      "lineId": ["1010"]
    },
    "s_1010036": {
      "cx": "476",
      "cy": "1086",
      "id": "1010036",
      "name": "丰台站",
      "transfer": false,
      "bezier": [{"x": "432", "y": "1086"}],
      "namePoint": {"x": "466", "y": "1076"},
      "nextId": ["s_1010037"],
      "lineId": ["1010"]
    },
    "s_1010037": {
      "cx": "432",
      "cy": "1036",
      "id": "1010037",
      "name": "泥洼",
      "transfer": false,
      "namePoint": {"x": "452", "y": "1041"},
      "nextId": ["s_1010038"],
      "lineId": ["1010"]
    },
    "s_1010038": {
      "cx": "432",
      "cy": "989",
      "id": "1010038",
      "name": "西局",
      "transfer": true,
      "namePoint": {"x": "452", "y": "994"},
      "nextId": ["s_1009008", "s_1009007"],
      "lineId": ["1010", "1014"]
    },
    "s_1010040": {
      "cx": "432",
      "cy": "888",
      "id": "1010040",
      "name": "莲花桥",
      "transfer": false,
      "namePoint": {"x": "386", "y": "893"},
      "nextId": ["s_1001009"],
      "lineId": ["1010"]
    },
    "s_1010042": {
      "cx": "379",
      "cy": "781",
      "id": "1010042",
      "name": "西钓鱼台",
      "transfer": false,
      "namePoint": {"x": "311", "y": "786"},
      "nextId": ["s_1006003"],
      "lineId": ["1010"]
    },
    "s_1010044": {
      "cx": "329",
      "cy": "673",
      "id": "1010044",
      "name": "车道沟",
      "transfer": false,
      "namePoint": {"x": "283", "y": "678"},
      "nextId": ["s_1010045"],
      "lineId": ["1010"]
    },
    "s_1010045": {
      "cx": "329",
      "cy": "620",
      "id": "1010045",
      "name": "长春桥",
      "transfer": false,
      "namePoint": {"x": "283", "y": "625"},
      "nextId": ["s_1010046"],
      "lineId": ["1010"]
    },
    "s_1010046": {
      "cx": "329",
      "cy": "569",
      "id": "1010046",
      "name": "火器营",
      "transfer": false,
      "bezier": [{"x": "329", "y": "521"}],
      "namePoint": {"x": "283", "y": "574"},
      "nextId": ["s_1010002"],
      "isEnd": "true",
      "lineId": ["1010"]
    },
    "s_1013016": {
      "cx": "657",
      "cy": "607",
      "id": "1013016",
      "name": "大钟寺",
      "transfer": false,
      "namePoint": {"x": "611", "y": "612"},
      "nextId": ["s_1010006"],
      "lineId": ["1013"]
    },
    "s_1013014": {
      "cx": "657",
      "cy": "486",
      "id": "1013014",
      "name": "五道口",
      "transfer": false,
      "namePoint": {"x": "611", "y": "491"},
      "nextId": ["s_1013013"],
      "lineId": ["1013"]
    },
    "s_1013013": {
      "cx": "657",
      "cy": "417",
      "id": "1013013",
      "name": "上地",
      "transfer": false,
      "namePoint": {"x": "623", "y": "422"},
      "nextId": ["s_1013012"],
      "lineId": ["1013"]
    },
    "s_1013012": {
      "cx": "657",
      "cy": "348",
      "id": "1013012",
      "name": "西二旗",
      "transfer": true,
      "bezier": [{"x": "657", "y": "310"}, null],
      "namePoint": {"x": "605", "y": "353"},
      "nextId": ["s_1013011"],
      "lineId": ["1013", "1052"]
    },
    "s_1013011": {
      "cx": "703",
      "cy": "310",
      "id": "1013011",
      "name": "龙泽",
      "transfer": false,
      "namePoint": {"x": "703", "y": "300"},
      "nextId": ["s_1013010"],
      "lineId": ["1013"]
    },
    "s_1013010": {
      "cx": "758",
      "cy": "310",
      "id": "1013010",
      "name": "回龙观",
      "transfer": false,
      "namePoint": {"x": "758", "y": "300"},
      "nextId": ["s_1008015"],
      "lineId": ["1013"]
    },
    "s_1013007": {
      "cx": "1072",
      "cy": "395",
      "id": "1013007",
      "name": "北苑",
      "transfer": false,
      "namePoint": {"x": "1090", "y": "400"},
      "nextId": ["s_1013006"],
      "lineId": ["1013"]
    },
    "s_1013006": {
      "cx": "1072",
      "cy": "448",
      "id": "1013006",
      "name": "望京西",
      "transfer": true,
      "namePoint": {"x": "1090", "y": "438"},
      "nextId": ["s_1010013", "s_1015014"],
      "lineId": ["1013", "1015"]
    },
    "s_1013004": {
      "cx": "1072",
      "cy": "583",
      "id": "1013004",
      "name": "光熙门",
      "transfer": false,
      "namePoint": {"x": "1092", "y": "588"},
      "nextId": ["s_1013003"],
      "lineId": ["1013"]
    },
    "s_1013003": {
      "cx": "1072",
      "cy": "631",
      "id": "1013003",
      "name": "柳芳",
      "transfer": false,
      "bezier": [{"x": "1072", "y": "680"}],
      "namePoint": {"x": "1092", "y": "636"},
      "nextId": ["s_1002006"],
      "lineId": ["1013"]
    },
    "s_1014001": {
      "cx": "1139",
      "cy": "340",
      "id": "1014001",
      "name": "善各庄",
      "transfer": false,
      "namePoint": {"x": "1159", "y": "345"},
      "nextId": ["s_1014002"],
      "lineId": ["1014"]
    },
    "s_1014002": {
      "cx": "1139",
      "cy": "375",
      "id": "1014002",
      "name": "来广营",
      "transfer": false,
      "namePoint": {"x": "1159", "y": "380"},
      "nextId": ["s_1014003"],
      "lineId": ["1014"]
    },
    "s_1014003": {
      "cx": "1139",
      "cy": "410",
      "id": "1014003",
      "name": "东湖渠",
      "transfer": false,
      "namePoint": {"x": "1159", "y": "415"},
      "nextId": ["s_1014004"],
      "lineId": ["1014"]
    },
    "s_1014004": {
      "cx": "1139",
      "cy": "449",
      "id": "1014004",
      "name": "望京",
      "transfer": true,
      "bezier": [{"x": "1139", "y": "493"}, null],
      "namePoint": {"x": "1159", "y": "439"},
      "nextId": ["s_1014005", "s_1013006"],
      "lineId": ["1014", "1015"]
    },
    "s_1014005": {
      "cx": "1148",
      "cy": "493",
      "id": "1014005",
      "name": "阜通",
      "transfer": false,
      "namePoint": {"x": "1168", "y": "498"},
      "nextId": ["s_1014006"],
      "lineId": ["1014"]
    },
    "s_1014006": {
      "cx": "1187",
      "cy": "529",
      "id": "1014006",
      "name": "望京南",
      "transfer": false,
      "bezier": [{"x": "1203", "y": "549"}],
      "namePoint": {"x": "1207", "y": "524"},
      "nextId": ["s_1014007"],
      "lineId": ["1014"]
    },
    "s_1014007": {
      "cx": "1229",
      "cy": "606",
      "id": "1014007",
      "name": "将台",
      "transfer": false,
      "namePoint": {"x": "1249", "y": "611"},
      "nextId": ["s_1014008"],
      "lineId": ["1014"]
    },
    "s_1014008": {
      "cx": "1229",
      "cy": "643",
      "id": "1014008",
      "name": "东风北桥",
      "transfer": false,
      "namePoint": {"x": "1249", "y": "648"},
      "nextId": ["s_1014009"],
      "lineId": ["1014"]
    },
    "s_1014009": {
      "cx": "1229",
      "cy": "680",
      "id": "1014009",
      "name": "枣营",
      "transfer": false,
      "namePoint": {"x": "1249", "y": "685"},
      "nextId": ["s_1014010"],
      "lineId": ["1014"]
    },
    "s_1014010": {
      "cx": "1229",
      "cy": "722",
      "id": "1014010",
      "name": "朝阳公园",
      "transfer": false,
      "namePoint": {"x": "1249", "y": "727"},
      "nextId": ["s_1006015"],
      "lineId": ["1014"]
    },
    "s_1014014": {
      "cx": "1229",
      "cy": "978",
      "id": "1014014",
      "name": "北工大西门",
      "transfer": false,
      "bezier": [{"x": "1229", "y": "1003"}],
      "namePoint": {"x": "1244", "y": "983"},
      "nextId": ["s_1010025"],
      "lineId": ["1014"]
    },
    "s_1014016": {
      "cx": "1072",
      "cy": "1003",
      "id": "1014016",
      "name": "方庄",
      "transfer": false,
      "namePoint": {"x": "1072", "y": "1023"},
      "nextId": ["s_1005003"],
      "lineId": ["1014"]
    },
    "s_1014018": {
      "cx": "930",
      "cy": "1003",
      "id": "1014018",
      "name": "景泰",
      "transfer": false,
      "namePoint": {"x": "925", "y": "1023"},
      "nextId": ["s_1014019"],
      "lineId": ["1014"]
    },
    "s_1014019": {
      "cx": "876",
      "cy": "1003",
      "id": "1014019",
      "name": "永定门外",
      "transfer": false,
      "namePoint": {"x": "852", "y": "1023"},
      "nextId": ["s_1004022"],
      "lineId": ["1014"]
    },
    "s_1014032": {
      "cx": "310",
      "cy": "989",
      "id": "1014032",
      "name": "大井",
      "transfer": false,
      "namePoint": {"x": "310", "y": "979"},
      "nextId": ["s_1014033"],
      "lineId": ["1014"]
    },
    "s_1014033": {
      "cx": "255",
      "cy": "989",
      "id": "1014033",
      "name": "郭庄子",
      "transfer": false,
      "namePoint": {"x": "245", "y": "979"},
      "nextId": ["s_1014034"],
      "lineId": ["1014"]
    },
    "s_1014034": {
      "cx": "203",
      "cy": "989",
      "id": "1014034",
      "name": "大瓦窑",
      "transfer": false,
      "namePoint": {"x": "193", "y": "979"},
      "nextId": ["s_1014035"],
      "lineId": ["1014"]
    },
    "s_1014035": {
      "cx": "153",
      "cy": "989",
      "id": "1014035",
      "name": "园博园",
      "transfer": false,
      "namePoint": {"x": "141", "y": "979"},
      "nextId": ["s_1014036"],
      "lineId": ["1014"]
    },
    "s_1014036": {
      "cx": "95",
      "cy": "989",
      "id": "1014036",
      "name": "张郭庄",
      "transfer": false,
      "namePoint": {"x": "85", "y": "979"},
      "lineId": ["1014"]
    },
    "s_1015001": {
      "cx": "1383",
      "cy": "166",
      "id": "1015001",
      "name": "俸伯",
      "transfer": false,
      "namePoint": {"x": "1383", "y": "188"},
      "nextId": ["s_1015002"],
      "lineId": ["1015"]
    },
    "s_1015002": {
      "cx": "1343",
      "cy": "166",
      "id": "1015002",
      "name": "顺义",
      "transfer": false,
      "namePoint": {"x": "1343", "y": "188"},
      "nextId": ["s_1015003"],
      "lineId": ["1015"]
    },
    "s_1015003": {
      "cx": "1290",
      "cy": "166",
      "id": "1015003",
      "name": "石门",
      "transfer": false,
      "namePoint": {"x": "1290", "y": "188"},
      "nextId": ["s_1015004"],
      "lineId": ["1015"]
    },
    "s_1015004": {
      "cx": "1246",
      "cy": "166",
      "id": "1015004",
      "name": "南法信",
      "transfer": false,
      "bezier": [{"x": "1238", "y": "166  "}],
      "namePoint": {"x": "1230", "y": "156"},
      "nextId": ["s_1015005"],
      "lineId": ["1015"]
    },
    "s_1015005": {
      "cx": "1238",
      "cy": "205",
      "id": "1015005",
      "name": "后沙峪",
      "transfer": false,
      "namePoint": {"x": "1258", "y": "210"},
      "nextId": ["s_1015006"],
      "lineId": ["1015"]
    },
    "s_1015006": {
      "cx": "1238",
      "cy": "245",
      "id": "1015006",
      "name": "花梨坎",
      "transfer": false,
      "namePoint": {"x": "1258", "y": "250"},
      "nextId": ["s_1015007"],
      "lineId": ["1015"]
    },
    "s_1015007": {
      "cx": "1238",
      "cy": "286",
      "id": "1015007",
      "name": "国展",
      "transfer": false,
      "namePoint": {"x": "1258", "y": "291"},
      "nextId": ["s_1015008"],
      "lineId": ["1015"]
    },
    "s_1015008": {
      "cx": "1238",
      "cy": "324",
      "id": "1015008",
      "name": "孙河",
      "transfer": false,
      "namePoint": {"x": "1258", "y": "329"},
      "nextId": ["s_1015009"],
      "lineId": ["1015"]
    },
    "s_1015009": {
      "cx": "1238",
      "cy": "364",
      "id": "1015009",
      "name": "马泉营",
      "transfer": false,
      "namePoint": {"x": "1258", "y": "369"},
      "nextId": ["s_1015010"],
      "lineId": ["1015"]
    },
    "s_1015010": {
      "cx": "1238",
      "cy": "404",
      "id": "1015010",
      "name": "崔各庄",
      "transfer": false,
      "bezier": [{"x": "1238", "y": "443  "}],
      "namePoint": {"x": "1258", "y": "409"},
      "nextId": ["s_1015011"],
      "lineId": ["1015"]
    },
    "s_1015011": {
      "cx": "1227",
      "cy": "443",
      "id": "1015011",
      "name": "望京东",
      "transfer": false,
      "bezier": [{"x": "1227", "y": "449"}],
      "namePoint": {"x": "1250", "y": "448"},
      "nextId": ["s_1014004"],
      "lineId": ["1015"]
    },
    "s_1015014": {
      "cx": "1024",
      "cy": "448",
      "id": "1015014",
      "name": "关庄",
      "transfer": false,
      "namePoint": {"x": "1024", "y": "468"},
      "nextId": ["s_1005017"],
      "lineId": ["1015"]
    },
    "s_1015016": {
      "cx": "914",
      "cy": "458",
      "id": "1015016",
      "name": "安立路",
      "transfer": false,
      "namePoint": {"x": "904", "y": "448"},
      "nextId": ["s_1008009"],
      "lineId": ["1015"]
    },
    "s_1015018": {
      "cx": "809",
      "cy": "469",
      "id": "1015018",
      "name": "北沙滩",
      "transfer": false,
      "namePoint": {"x": "799", "y": "459"},
      "nextId": ["s_1015019"],
      "lineId": ["1015"]
    },
    "s_1015019": {
      "cx": "741",
      "cy": "469",
      "id": "1015019",
      "name": "六道口",
      "transfer": false,
      "namePoint": {"x": "731", "y": "489"},
      "nextId": ["s_1015020"],
      "lineId": ["1015"]
    },
    "s_1015020": {
      "cx": "680",
      "cy": "469",
      "id": "1015020",
      "name": "清华东路西口",
      "transfer": false,
      "namePoint": {"x": "680", "y": "459"},
      "lineId": ["1015"]
    },
    "s_1016001": {
      "cx": "88",
      "cy": "201",
      "id": "1016001",
      "name": "北安河",
      "transfer": false,
      "namePoint": {"x": "78", "y": "190"},
      "nextId": ["s_1016002"],
      "lineId": ["1016"]
    },
    "s_1016002": {
      "cx": "165",
      "cy": "201",
      "id": "1016002",
      "name": "温阳路",
      "transfer": false,
      "namePoint": {"x": "155", "y": "190"},
      "nextId": ["s_1016003"],
      "lineId": ["1016"]
    },
    "s_1016003": {
      "cx": "235",
      "cy": "201",
      "id": "1016003",
      "name": "稻香湖路",
      "transfer": false,
      "namePoint": {"x": "222", "y": "190"},
      "nextId": ["s_1016004"],
      "lineId": ["1016"]
    },
    "s_1016004": {
      "cx": "305",
      "cy": "201",
      "id": "1016004",
      "name": "屯佃",
      "transfer": false,
      "namePoint": {"x": "299", "y": "190"},
      "nextId": ["s_1016005"],
      "lineId": ["1016"]
    },
    "s_1016005": {
      "cx": "381",
      "cy": "201",
      "id": "1016005",
      "name": "永丰",
      "transfer": false,
      "bezier": [{"x": "414", "y": "201"}],
      "namePoint": {"x": "381", "y": "191"},
      "nextId": ["s_1016006"],
      "lineId": ["1016"]
    },
    "s_1016006": {
      "cx": "414",
      "cy": "242",
      "id": "1016006",
      "name": "永丰南",
      "transfer": false,
      "namePoint": {"x": "434", "y": "247"},
      "nextId": ["s_1016007"],
      "lineId": ["1016"]
    },
    "s_1016007": {
      "cx": "415",
      "cy": "278",
      "id": "1016007",
      "name": "西北旺",
      "transfer": false,
      "namePoint": {"x": "435", "y": "283"},
      "nextId": ["s_1016008"],
      "lineId": ["1016"]
    },
    "s_1016008": {
      "cx": "415",
      "cy": "312",
      "id": "1016008",
      "name": "马连洼",
      "transfer": false,
      "namePoint": {"x": "435", "y": "317"},
      "nextId": ["s_1004004"],
      "lineId": ["1016"]
    },
    "s_1051004": {
      "cx": "1377",
      "cy": "846",
      "id": "1051004",
      "name": "高碑店",
      "transfer": false,
      "namePoint": {"x": "1370", "y": "866"},
      "nextId": ["s_1051005"],
      "lineId": ["1051"]
    },
    "s_1051005": {
      "cx": "1445",
      "cy": "846",
      "id": "1051005",
      "name": "传媒大学",
      "transfer": false,
      "namePoint": {"x": "1426", "y": "866"},
      "nextId": ["s_1051006"],
      "lineId": ["1051"]
    },
    "s_1051006": {
      "cx": "1494",
      "cy": "846",
      "id": "1051006",
      "name": "双桥",
      "transfer": false,
      "namePoint": {"x": "1494", "y": "866"},
      "nextId": ["s_1051007"],
      "lineId": ["1051"]
    },
    "s_1051007": {
      "cx": "1539",
      "cy": "846",
      "id": "1051007",
      "name": "管庄",
      "transfer": false,
      "namePoint": {"x": "1539", "y": "866"},
      "nextId": ["s_1051008"],
      "lineId": ["1051"]
    },
    "s_1051008": {
      "cx": "1589",
      "cy": "846",
      "id": "1051008",
      "name": "八里桥",
      "transfer": false,
      "namePoint": {"x": "1589", "y": "836"},
      "nextId": ["s_1051009"],
      "lineId": ["1051"]
    },
    "s_1051009": {
      "cx": "1637",
      "cy": "900",
      "id": "1051009",
      "name": "通州北苑",
      "transfer": false,
      "namePoint": {"x": "1655", "y": "905"},
      "nextId": ["s_1051010"],
      "lineId": ["1051"]
    },
    "s_1051010": {
      "cx": "1664",
      "cy": "940",
      "id": "1051010",
      "name": "果园",
      "transfer": false,
      "namePoint": {"x": "1685", "y": "945"},
      "nextId": ["s_1051011"],
      "lineId": ["1051"]
    },
    "s_1051011": {
      "cx": "1689",
      "cy": "975",
      "id": "1051011",
      "name": "九棵树",
      "transfer": false,
      "namePoint": {"x": "1709", "y": "980"},
      "nextId": ["s_1051012"],
      "lineId": ["1051"]
    },
    "s_1051012": {
      "cx": "1713",
      "cy": "1012",
      "id": "1051012",
      "name": "梨园",
      "transfer": false,
      "namePoint": {"x": "1733", "y": "1017"},
      "nextId": ["s_1051013"],
      "lineId": ["1051"]
    },
    "s_1051013": {
      "cx": "1739",
      "cy": "1049",
      "id": "1051013",
      "name": "临河里",
      "transfer": false,
      "namePoint": {"x": "1759", "y": "1054"},
      "nextId": ["s_1051014"],
      "lineId": ["1051"]
    },
    "s_1051014": {
      "cx": "1766",
      "cy": "1089",
      "id": "1051014",
      "name": "土桥",
      "transfer": false,
      "namePoint": {"x": "1786", "y": "1094"},
      "lineId": ["1051"]
    },
    "s_1052012": {
      "cx": "281",
      "cy": "0",
      "id": "1052012",
      "name": "昌平西山口",
      "transfer": false,
      "namePoint": {"x": "201", "y": "5"},
      "nextId": ["s_1052011"],
      "lineId": ["1052"]
    },
    "s_1052011": {
      "cx": "357",
      "cy": "15",
      "id": "1052011",
      "name": "十三陵景区",
      "transfer": false,
      "namePoint": {"x": "377", "y": "10"},
      "nextId": ["s_1052010"],
      "lineId": ["1052"]
    },
    "s_1052010": {
      "cx": "437",
      "cy": "56",
      "id": "1052010",
      "name": "昌平",
      "transfer": false,
      "namePoint": {"x": "447", "y": "46"},
      "nextId": ["s_1052009"],
      "lineId": ["1052"]
    },
    "s_1052009": {
      "cx": "528",
      "cy": "56",
      "id": "1052009",
      "name": "昌平东关",
      "transfer": false,
      "namePoint": {"x": "510", "y": "79"},
      "nextId": ["s_1052008"],
      "lineId": ["1052"]
    },
    "s_1052008": {
      "cx": "627",
      "cy": "56",
      "id": "1052008",
      "name": "北邵洼",
      "transfer": false,
      "bezier": [{"x": "657", "y": "56"}],
      "namePoint": {"x": "615", "y": "46"},
      "nextId": ["s_1052007"],
      "lineId": ["1052"]
    },
    "s_1052007": {
      "cx": "657",
      "cy": "95",
      "id": "1052007",
      "name": "南邵",
      "transfer": false,
      "namePoint": {"x": "623", "y": "100"},
      "nextId": ["s_1052006"],
      "lineId": ["1052"]
    },
    "s_1052006": {
      "cx": "657",
      "cy": "131",
      "id": "1052006",
      "name": "沙河高教园",
      "transfer": false,
      "namePoint": {"x": "577", "y": "136"},
      "nextId": ["s_1052005"],
      "lineId": ["1052"]
    },
    "s_1052005": {
      "cx": "657",
      "cy": "167",
      "id": "1052005",
      "name": "沙河",
      "transfer": false,
      "namePoint": {"x": "623", "y": "172"},
      "nextId": ["s_1052004"],
      "lineId": ["1052"]
    },
    "s_1052004": {
      "cx": "657",
      "cy": "200",
      "id": "1052004",
      "name": "巩华城",
      "transfer": false,
      "namePoint": {"x": "611", "y": "205"},
      "nextId": ["s_1008019"],
      "lineId": ["1052"]
    },
    "s_1052002": {
      "cx": "657",
      "cy": "267",
      "id": "1052002",
      "name": "生命科学园",
      "transfer": false,
      "namePoint": {"x": "580", "y": "272"},
      "nextId": ["s_1013012"],
      "lineId": ["1052"]
    },
    "s_1053012": {
      "cx": "0",
      "cy": "1365",
      "id": "1053012",
      "name": "苏庄",
      "transfer": false,
      "namePoint": {"x": "-10", "y": "1385"},
      "nextId": ["s_1053011"],
      "lineId": ["1053"]
    },
    "s_1053011": {
      "cx": "63",
      "cy": "1365",
      "id": "1053011",
      "name": "良乡南关",
      "transfer": false,
      "namePoint": {"x": "43", "y": "1385"},
      "nextId": ["s_1053010"],
      "lineId": ["1053"]
    },
    "s_1053010": {
      "cx": "153",
      "cy": "1365",
      "id": "1053010",
      "name": "良乡大学城西",
      "transfer": false,
      "namePoint": {"x": "117", "y": "1385"},
      "nextId": ["s_1053009"],
      "lineId": ["1053"]
    },
    "s_1053009": {
      "cx": "216",
      "cy": "1365",
      "id": "1053009",
      "name": "良乡大学城",
      "transfer": false,
      "bezier": [{"x": "251", "y": "1365"}],
      "namePoint": {"x": "226", "y": "1385"},
      "nextId": ["s_1053008"],
      "lineId": ["1053"]
    },
    "s_1053008": {
      "cx": "271",
      "cy": "1335",
      "id": "1053008",
      "name": "良乡大学城北",
      "transfer": false,
      "namePoint": {"x": "172", "y": "1340"},
      "nextId": ["s_1053007"],
      "lineId": ["1053"]
    },
    "s_1053007": {
      "cx": "292",
      "cy": "1301",
      "id": "1053007",
      "name": "广阳城",
      "transfer": false,
      "namePoint": {"x": "246", "y": "1306"},
      "nextId": ["s_1053006"],
      "lineId": ["1053"]
    },
    "s_1053006": {
      "cx": "312",
      "cy": "1270",
      "id": "1053006",
      "name": "篱笆房",
      "transfer": false,
      "namePoint": {"x": "266", "y": "1275"},
      "nextId": ["s_1053005"],
      "lineId": ["1053"]
    },
    "s_1053005": {
      "cx": "333",
      "cy": "1236",
      "id": "1053005",
      "name": "长阳",
      "transfer": false,
      "namePoint": {"x": "299", "y": "1241"},
      "nextId": ["s_1053004"],
      "lineId": ["1053"]
    },
    "s_1053004": {
      "cx": "354",
      "cy": "1203",
      "id": "1053004",
      "name": "稻田",
      "transfer": false,
      "namePoint": {"x": "320", "y": "1208"},
      "nextId": ["s_1053003"],
      "lineId": ["1053"]
    },
    "s_1053003": {
      "cx": "374",
      "cy": "1171",
      "id": "1053003",
      "name": "大葆台",
      "transfer": false,
      "namePoint": {"x": "327", "y": "1176"},
      "nextId": ["s_1009002"],
      "lineId": ["1053"]
    },
    "s_1054003": {
      "cx": "1472",
      "cy": "360",
      "id": "1054003",
      "name": "T2航站楼",
      "transfer": false,
      "namePoint": {"x": "1482", "y": "346"},
      "nextId": ["s_1054004"],
      "lineId": ["1054"]
    },
    "s_1054004": {
      "cx": "1578",
      "cy": "360",
      "id": "1054004",
      "name": "T3航站楼",
      "transfer": false,
      "namePoint": {"x": "1568", "y": "350"},
      "bezier": [{"x": "1488", "y": "475"}],
      "nextId": ["s_1010015"],
      "isEnd": "true",
      "lineId": ["1054"]
    },
    "s_1055002": {
      "cx": "973",
      "cy": "1126",
      "id": "1055002",
      "name": "肖村",
      "transfer": false,
      "namePoint": {"x": "993", "y": "1131"},
      "nextId": ["s_1055003"],
      "lineId": ["1055"]
    },
    "s_1055003": {
      "cx": "997",
      "cy": "1160",
      "id": "1055003",
      "name": "小红门",
      "transfer": false,
      "namePoint": {"x": "1015", "y": "1165"},
      "nextId": ["s_1055004"],
      "lineId": ["1055"]
    },
    "s_1055004": {
      "cx": "1015",
      "cy": "1189",
      "id": "1055004",
      "name": "旧宫",
      "transfer": false,
      "namePoint": {"x": "1035", "y": "1194"},
      "nextId": ["s_1055005"],
      "lineId": ["1055"]
    },
    "s_1055005": {
      "cx": "1033",
      "cy": "1215",
      "id": "1055005",
      "name": "亦庄桥",
      "transfer": false,
      "namePoint": {"x": "1053", "y": "1220"},
      "nextId": ["s_1055006"],
      "lineId": ["1055"]
    },
    "s_1055006": {
      "cx": "1054",
      "cy": "1246",
      "id": "1055006",
      "name": "亦庄文化园",
      "transfer": false,
      "namePoint": {"x": "1074", "y": "1251"},
      "nextId": ["s_1055007"],
      "lineId": ["1055"]
    },
    "s_1055007": {
      "cx": "1072",
      "cy": "1274",
      "id": "1055007",
      "name": "万源街",
      "transfer": false,
      "namePoint": {"x": "1094", "y": "1279"},
      "nextId": ["s_1055008"],
      "lineId": ["1055"]
    },
    "s_1055008": {
      "cx": "1093",
      "cy": "1304",
      "id": "1055008",
      "name": "荣京东街",
      "transfer": false,
      "namePoint": {"x": "1115", "y": "1309"},
      "nextId": ["s_1055009"],
      "lineId": ["1055"]
    },
    "s_1055009": {
      "cx": "1111",
      "cy": "1331",
      "id": "1055009",
      "name": "荣昌东街",
      "transfer": false,
      "bezier": [{"x": "1130", "y": "1363"}],
      "namePoint": {"x": "1133", "y": "1336"},
      "nextId": ["s_1055010"],
      "lineId": ["1055"]
    },
    "s_1055010": {
      "cx": "1155",
      "cy": "1363",
      "id": "1055010",
      "name": "同济南路",
      "transfer": false,
      "namePoint": {"x": "1135", "y": "1383"},
      "nextId": ["s_1055011"],
      "lineId": ["1055"]
    },
    "s_1055011": {
      "cx": "1218",
      "cy": "1363",
      "id": "1055011",
      "name": "经海路",
      "transfer": false,
      "namePoint": {"x": "1210", "y": "1383"},
      "nextId": ["s_1055012"],
      "lineId": ["1055"]
    },
    "s_1055012": {
      "cx": "1280",
      "cy": "1363",
      "id": "1055012",
      "name": "次渠南",
      "transfer": false,
      "namePoint": {"x": "1270", "y": "1383"},
      "nextId": ["s_1055013"],
      "lineId": ["1055"]
    },
    "s_1055013": {
      "cx": "1341",
      "cy": "1363",
      "id": "1055013",
      "name": "次渠",
      "transfer": false,
      "namePoint": {"x": "1341", "y": "1383"},
      "lineId": ["1055"]
    }
  },
  centerPoint: {
    "cx": "874",
    "cy": "836",
    "id": "1001016",
    "name": "天安门东",
    "transfer": "false",
    "namePoint": {"x": "874", "y": "856"}
  }
}